Res-social/Res-firecracker-set-v1/firecracker_t_10_c_30_readHomeTimeline_composeVcpu_6_wrkVcpu_1/wrk.txt
Running 1m test @ http://nginx-thrift:8080/wrk2-api/home-timeline/read
  10 threads and 30 connections
  Thread calibration: mean lat.: 5169.041ms, rate sampling interval: 17956ms
  Thread calibration: mean lat.: 5174.144ms, rate sampling interval: 17956ms
  Thread calibration: mean lat.: 5243.439ms, rate sampling interval: 18022ms
  Thread calibration: mean lat.: 5223.372ms, rate sampling interval: 18038ms
  Thread calibration: mean lat.: 5299.522ms, rate sampling interval: 18038ms
  Thread calibration: mean lat.: 5295.291ms, rate sampling interval: 18022ms
  Thread calibration: mean lat.: 5272.298ms, rate sampling interval: 18055ms
  Thread calibration: mean lat.: 5235.110ms, rate sampling interval: 18038ms
  Thread calibration: mean lat.: 5293.478ms, rate sampling interval: 18071ms
  Thread calibration: mean lat.: 5260.754ms, rate sampling interval: 18087ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    34.87s    14.37s    0.99m    57.75%
    Req/Sec    38.05      0.22    39.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   34.90s 
 75.000%   47.32s 
 90.000%    0.91m 
 99.000%    0.99m 
 99.900%    1.00m 
 99.990%    1.00m 
 99.999%    1.00m 
100.000%    1.00m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    9961.471     0.000000            1         1.00
   14934.015     0.100000         1945         1.11
   19922.943     0.200000         3886         1.25
   24920.063     0.300000         5829         1.43
   29900.799     0.400000         7771         1.67
   34897.919     0.500000         9723         2.00
   37388.287     0.550000        10693         2.22
   39845.887     0.600000        11655         2.50
   42336.255     0.650000        12633         2.86
   44826.623     0.700000        13602         3.33
   47316.991     0.750000        14569         4.00
   48562.175     0.775000        15057         4.44
   49807.359     0.800000        15541         5.00
   51052.543     0.825000        16027         5.71
   52330.495     0.850000        16525         6.67
   53542.911     0.875000        16999         8.00
   54165.503     0.887500        17241         8.89
   54820.863     0.900000        17498        10.00
   55443.455     0.912500        17740        11.43
   56033.279     0.925000        17971        13.33
   56655.871     0.937500        18212        16.00
   56983.551     0.943750        18340        17.78
   57278.463     0.950000        18456        20.00
   57606.143     0.956250        18583        22.86
   57933.823     0.962500        18712        26.67
   58228.735     0.968750        18827        32.00
   58359.807     0.971875        18879        35.56
   58523.647     0.975000        18941        40.00
   58687.487     0.978125        19005        45.71
   58851.327     0.981250        19068        53.33
   59015.167     0.984375        19131        64.00
   59080.703     0.985938        19159        71.11
   59146.239     0.987500        19183        80.00
   59244.543     0.989062        19222        91.43
   59310.079     0.990625        19248       106.67
   59375.615     0.992188        19274       128.00
   59441.151     0.992969        19301       142.22
   59473.919     0.993750        19312       160.00
   59506.687     0.994531        19324       182.86
   59539.455     0.995313        19338       213.33
   59604.991     0.996094        19362       256.00
   59604.991     0.996484        19362       284.44
   59637.759     0.996875        19375       320.00
   59637.759     0.997266        19375       365.71
   59670.527     0.997656        19391       426.67
   59670.527     0.998047        19391       512.00
   59670.527     0.998242        19391       568.89
   59703.295     0.998437        19402       640.00
   59703.295     0.998633        19402       731.43
   59736.063     0.998828        19415       853.33
   59736.063     0.999023        19415      1024.00
   59736.063     0.999121        19415      1137.78
   59736.063     0.999219        19415      1280.00
   59736.063     0.999316        19415      1462.86
   59736.063     0.999414        19415      1706.67
   59768.831     0.999512        19424      2048.00
   59768.831     0.999561        19424      2275.56
   59768.831     0.999609        19424      2560.00
   59768.831     0.999658        19424      2925.71
   59768.831     0.999707        19424      3413.33
   59768.831     0.999756        19424      4096.00
   59768.831     0.999780        19424      4551.11
   59768.831     0.999805        19424      5120.00
   59768.831     0.999829        19424      5851.43
   59768.831     0.999854        19424      6826.67
   59768.831     0.999878        19424      8192.00
   59768.831     0.999890        19424      9102.22
   59768.831     0.999902        19424     10240.00
   59768.831     0.999915        19424     11702.86
   59768.831     0.999927        19424     13653.33
   59768.831     0.999939        19424     16384.00
   59768.831     0.999945        19424     18204.44
   59801.599     0.999951        19425     20480.00
   59801.599     1.000000        19425          inf
#[Mean    =    34866.146, StdDeviation   =    14373.854]
#[Max     =    59768.832, Total count    =        19425]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  23081 requests in 1.00m, 318.35MB read
  Socket errors: connect 0, read 0, write 0, timeout 405
Requests/sec:    384.58
Transfer/sec:      5.30MB